<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="3" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="position_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="position_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="beam_idx" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="beam_idx">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_65978" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="5" name="ShapeOf_65964" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_65966" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_65968" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="Gather_65969" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_65971" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_65973" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_65975" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Concat_65976" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Broadcast_65979" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>0</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="ReadValue_65576" type="ReadValue" version="opset6">
			<data variable_id="past_key_values.9.valuepresent.9.value" variable_type="f32" variable_shape="?,4,?,64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>0</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="past_key_values.9.value">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_65030" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="16" name="Gather_65031" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_56778" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2048" offset="28" size="8192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="self.model.embed_tokens.weight" type="Const" version="opset1">
			<data element_type="u8" shape="32000, 2048" offset="8220" size="65536000" />
			<output>
				<port id="0" precision="U8">
					<dim>32000</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Convert_82815" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>32000</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32000</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="self.model.embed_tokens.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="32000, 1" offset="65544220" size="32000" />
			<output>
				<port id="0" precision="U8">
					<dim>32000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Convert_82818" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>32000</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="self.model.embed_tokens.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>32000</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32000</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32000</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="self.model.embed_tokens.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="32000, 1" offset="65576220" size="64000" />
			<output>
				<port id="0" precision="FP16">
					<dim>32000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="self.model.embed_tokens.weight/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>32000</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32000</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>32000</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.model.embed_tokens/ov_ext::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32000</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32000</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.model.embed_tokens/ov_ext::embedding/Convert_1" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.model.embed_tokens/ov_ext::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="28" name="__module.model.embed_tokens/ov_ext::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>32000</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="232,314,325,hidden_states.1,inputs_embeds">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_56706" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2048" offset="65640220" size="8192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_56705" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="65648412" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_56703" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="65648416" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.model.layers.0.input_layernorm/aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="315">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_381" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65648420" size="8" />
			<output>
				<port id="0" precision="I64" names="316">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.model.layers.0.input_layernorm/aten::mean/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="317,variance.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_56704" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="65648428" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="__module.model.layers.0.input_layernorm/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="318">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.model.layers.0.input_layernorm/aten::rsqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.model.layers.0.input_layernorm/aten::rsqrt/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="319">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.model.layers.0.input_layernorm/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="320,321,hidden_states.3,hidden_states.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.model.layers.0.input_layernorm/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="322,324,hidden_states.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="self.model.layers.0.self_attn.q_proj.weight" type="Const" version="opset1">
			<data element_type="i4" shape="2048, 16, 128" offset="65648432" size="2097152" />
			<output>
				<port id="0" precision="I4">
					<dim>2048</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Convert_405578" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="I4">
					<dim>2048</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2048</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="self.model.layers.0.self_attn.q_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="2048, 16, 1" offset="67745584" size="65536" />
			<output>
				<port id="0" precision="FP16">
					<dim>2048</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="self.model.layers.0.self_attn.q_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>2048</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>2048</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2048</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_405582" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="67811120" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Reshape_405583" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP16">
					<dim>2048</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2048</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.model.layers.0.self_attn.q_proj/ov_ext::linear/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2048</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.model.layers.0.self_attn.q_proj/ov_ext::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="333">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_63456" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="67811136" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.model.layers.0.self_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="335">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.model.layers.0.self_attn/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="67811168" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.model.layers.0.self_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="336,q.1">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.model.rotary_emb/aten::to/Convert" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1" offset="67811184" size="128" />
			<output>
				<port id="0" precision="FP32" names="285">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="ShapeOf_58173" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_58174" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_58175" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="57" name="Gather_58176" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="1017,1033,1175,1191,1333,1349,1491,1507,1649,1665,1807,1823,1965,1981,2123,2139,2281,2297,2439,2455,2597,2613,2755,2771,286,2913,2929,3071,3087,3229,3245,3387,3403,3545,3561,3703,3719,385,401,543,559,701,717,859,875">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_49936" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811312" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_49938" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811312" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.model.rotary_emb/prim::ListConstruct" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.model.rotary_emb/aten::expand/Broadcast" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="288,289,294,inv_freq_expanded,inv_freq_expanded.1">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="182" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="67811312" size="8" />
			<output>
				<port id="0" precision="I64" names="182" />
			</output>
		</layer>
		<layer id="63" name="__module.model.rotary_emb/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="291,292">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.model.rotary_emb/aten::to/Convert_3" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="293,295,position_ids_expanded,position_ids_expanded.1">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.model.rotary_emb/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="296">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="__module.model.rotary_emb/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="67811320" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.model.rotary_emb/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="297,freqs">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.model.rotary_emb/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="299,emb">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.model.rotary_emb/aten::cos/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="300,301,304,307,cos.1,cos.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1137,1295,1453,1611,1769,1927,2085,2243,2401,2559,2717,2875,3033,3191,3349,347,3507,3665,505,663,821,979,cos,cos.11,cos.13,cos.15,cos.17,cos.19,cos.21,cos.23,cos.25,cos.27,cos.29,cos.31,cos.33,cos.35,cos.37,cos.39,cos.41,cos.43,cos.45,cos.5,cos.7,cos.9">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.model.layers.0.self_attn/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="349">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_683" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811332" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_685" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811340" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_687" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811312" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_639" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811348" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.model.layers.0.self_attn/aten::slice/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="359,x2.1">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.model.layers.0.self_attn/aten::neg/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="67811356" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="78" name="__module.model.layers.0.self_attn/aten::neg/ConvertLike" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="79" name="__module.model.layers.0.self_attn/aten::neg/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="360">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_580" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_624" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811332" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_626" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811312" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_578" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811348" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module.model.layers.0.self_attn/aten::slice/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="354,x1.1">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.model.layers.0.self_attn/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="362">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="__module.model.rotary_emb/aten::sin/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="302,303,305,308,sin.1,sin.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="1138,1296,1454,1612,1770,1928,2086,2244,2402,2560,2718,2876,3034,3192,3350,348,3508,3666,506,664,822,980,sin,sin.11,sin.13,sin.15,sin.17,sin.19,sin.21,sin.23,sin.25,sin.27,sin.29,sin.31,sin.33,sin.35,sin.37,sin.39,sin.41,sin.43,sin.45,sin.5,sin.7,sin.9">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.model.layers.0.self_attn/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="363">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="__module.model.layers.0.self_attn/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="364,query.1">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_65990" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="91" name="Constant_65983" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_65985" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_65987" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Concat_65988" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Broadcast_65991" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>0</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="ReadValue_65490" type="ReadValue" version="opset6">
			<data variable_id="past_key_values.0.keypresent.0.key" variable_type="f32" variable_shape="?,4,?,64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>0</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="past_key_values.0.key">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_64973" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="98" name="Gather_64974" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="self.model.layers.0.self_attn.k_proj.weight" type="Const" version="opset1">
			<data element_type="i4" shape="256, 16, 128" offset="67811360" size="262144" />
			<output>
				<port id="0" precision="I4">
					<dim>256</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Convert_614402" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="I4">
					<dim>256</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="self.model.layers.0.self_attn.k_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="256, 16, 1" offset="68073504" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="self.model.layers.0.self_attn.k_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>16</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>256</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_614406" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="68081696" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Reshape_614407" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>256</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.model.layers.0.self_attn.k_proj/ov_ext::linear/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.model.layers.0.self_attn.k_proj/ov_ext::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="338">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_63457" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="68081712" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.model.layers.0.self_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="340">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.model.layers.0.self_attn/aten::transpose/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="67811168" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="__module.model.layers.0.self_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="341,k.1">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.model.layers.0.self_attn/aten::mul/Multiply_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="365">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_826" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811332" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_828" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811340" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_830" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811312" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_782" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811348" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.model.layers.0.self_attn/aten::slice/Slice_2" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="375,x2.3">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.model.layers.0.self_attn/aten::neg/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="67811356" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="118" name="__module.model.layers.0.self_attn/aten::neg/ConvertLike_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="119" name="__module.model.layers.0.self_attn/aten::neg/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="376">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_723" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_767" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811332" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_769" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811312" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_721" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="67811348" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="__module.model.layers.0.self_attn/aten::slice/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="370,x1.3">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="__module.model.layers.0.self_attn/aten::cat/Concat_1" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="378">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="__module.model.layers.0.self_attn/aten::mul/Multiply_3" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="379">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="__module.model.layers.0.self_attn/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="380,key_states.1">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="__module.model.layers.0.self_attn/aten::cat/Concat_2" type="Concat" version="opset1">
			<data axis="-2" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="390,391,hidden_states.9">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="183" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="68081744" size="8" />
			<output>
				<port id="0" precision="I64" names="183" />
			</output>
		</layer>
		<layer id="130" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="392,393,394">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="__module.model.layers.0.self_attn/aten::size/ShapeOf_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
